# Coding Exercises (Part 1)

## Full Data Workflow A-Z: Merging, Joining, Concatenating

### Exercise 12: Merging, joining, aligning and concatenating Data

Now, you will have the opportunity to analyze your own dataset. <br>
__Follow the instructions__ and insert your code! You are either requested to 
- Complete the Code and __Fill in the gaps__. Gaps are marked with "__---__" and are __placeholders__ for your code fragment. 
- Write Code completely __on your own__

In some exercises, you will find questions that can only be answered, if your code is correct and returns the right output! The correct answer is provided below your coding cell. There you can check whether your code is correct.

If you need a hint, check the __Hints Section__ at the end of this Notebook. Exercises and Hints are numerated accordingly.

If you need some further help or if you want to check your code, you can also check the __solutions notebook__.

### Have Fun!

--------------------------------------------------------------------------------------------------------------

## Option 1: Self_guided

### Concatenating DataFrames vertically

__Import__ the cars dataset (with cars from usa and europe) from the csv-file __cars_clean.csv__. <br>
Also __import__ the csv-file __cars_jap.csv__ (with cars from japan) and __concatenate__ both DataFrames __vertically__! <br>
__Save__ the __concatenated DataFrame__ in the variable __cars_all__! <br>
Finally, __sort__ cars_all by the model_year from __low to high__!

In [17]:
import pandas as pd

In [18]:
cars_clean = pd.read_csv("cars_clean.csv")
cars_jap = pd.read_csv("cars_jap.csv")

In [19]:
cars_clean.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [20]:
cars_jap.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'weight', 'acc', 'year', 'name'], dtype='object')

In [21]:
len(cars_clean.columns)

9

In [22]:
len(cars_jap.columns)

8

In [23]:
cars_jap.head(3)

    mpg  cyl   disp    hp  weight   acc  year                   name
0  24.0    4  113.0  95.0    2372  15.0    70  toyota corona mark ii
1  27.0    4   97.0  88.0    2130  14.5    70           datsun pl510
2  27.0    4   97.0  88.0    2130  14.5    71           datsun pl510

In [24]:
cars_clean.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [25]:
cars_jap.insert(loc= 7, column= "origin", value= "jap")

In [26]:
cars_jap.head(1)

    mpg  cyl   disp    hp  weight   acc  year origin                   name
0  24.0    4  113.0  95.0    2372  15.0    70    jap  toyota corona mark ii

In [27]:
cars_jap.columns = cars_clean.columns

In [28]:
cars_jap.columns == cars_clean.columns

array([ True,  True,  True,  True,  True,  True,  True,  True,  True])

In [29]:
cars_all = pd.concat([cars_clean, cars_jap], ignore_index= True)

In [30]:
cars_all.sort_values(by= "model_year", inplace= True)

In [31]:
cars_all

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
314,27.0,4,97.0,88.0,2130,14.5,70,jap,datsun pl510
26,9.0,8,304.0,193.0,4732,18.5,70,usa,ih 1200d
25,11.0,8,318.0,210.0,4382,13.5,70,usa,dodge d200
24,10.0,8,307.0,200.0,4376,15.0,70,usa,chevrolet c20
...,...,...,...,...,...,...,...,...,...
309,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
310,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
311,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
390,38.0,4,91.0,67.0,1995,16.2,82,jap,datsun 310 gx
391,32.0,4,144.0,96.0,2665,13.9,82,jap,toyota celica gt

### Left Join

__Import__ the csv-files __summer.csv__ (as summer) and __dictionary.csv__ (as dic) which contains the __full country name__ for the olympic country codes as well as __population__ and __gdp__ statistics for some countries.<br>

__"Copy and paste"__ the __full country name__, __population__ and __gdp__ from the dic DataFrame __into the summer DataFrame__ with a __Left Join__!<br>
__Save__ the new merged DataFrame in the variable __summer_new__!<br>

__Inspect__ summer_new and determine the __olympic country codes__ for which the dic DataFrame does __not provide__ any information!

In [32]:
summer = pd.read_csv("summer.csv")
dic = pd.read_csv("dictionary.csv")

In [33]:
summer.head(3)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [34]:
dic.head(3)

       Country Code  Population  GDP per Capita
0  Afghanistan  AFG  32526562.0      594.323081
1      Albania  ALB   2889167.0     3945.217582
2      Algeria  ALG  39666519.0     4206.031232

In [35]:
summer.rename(columns= {"Country": "Code"}, inplace= True)

In [36]:
#summer.merge(dic, how= "left", left_on= "Country", right_on= "Code") <-- pierwsz próba przed zmianą nazwy kolumny w summer {"Country": "Code"}
summer_new = summer.merge(dic, how= "left", on= "Code")

In [40]:
summer_new.isna().any(axis= 1) # Sprawdza w którym wierszu czegos brakuje

0        False
1        False
2        False
3        False
4        False
         ...
31160    False
31161     True
31162    False
31163    False
31164    False
Length: 31165, dtype: bool

In [37]:
summer_new[summer_new.isna().any(axis= 1)]

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Country,Population,GDP per Capita
132,1896,Athens,Tennis,Tennis,"FLACK, Edwin",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN
133,1896,Athens,Tennis,Tennis,"ROBERTSON, George Stuart",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN
134,1896,Athens,Tennis,Tennis,"BOLAND, John",ZZX,Men,Doubles,Gold,NaN,NaN,NaN
135,1896,Athens,Tennis,Tennis,"TRAUN, Friedrich",ZZX,Men,Doubles,Gold,NaN,NaN,NaN
136,1896,Athens,Tennis,Tennis,"KASDAGLIS, Dionysios",ZZX,Men,Doubles,Silver,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
31131,2012,London,Wrestling,Wrestling Freestyle,"LASHGARI, Ehsan Naser",IRI,Men,Wf 84 KG,Bronze,Iran,79109272.0,NaN
31137,2012,London,Wrestling,Wrestling Freestyle,"LOPEZ NUNEZ, Mijain",CUB,Men,Wg 120 KG,Gold,Cuba,11389562.0,NaN
31141,2012,London,Wrestling,Wrestling Freestyle,"SORYAN REIHANPOUR, Hamid Mohammad",IRI,Men,Wg 55 KG,Gold,Iran,79109272.0,NaN
31145,2012,London,Wrestling,Wrestling Freestyle,"NOROOZI, Omid Haji",IRI,Men,Wg 60 KG,Gold,Iran,79109272.0,NaN
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold,Iran,79109272.0,NaN

In [105]:
country_population_GDP_na_boolseries = summer_new.Country.isna() & summer_new.Population.isna() & summer_new["GDP per Capita"].isna()

In [106]:
country_population_GDP_na_boolseries.value_counts()

False    25742
True      5423
dtype: int64

In [110]:
summer_new.loc[country_population_GDP_na_boolseries]

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Country,Population,GDP per Capita,_merge
132,1896,Athens,Tennis,Tennis,"FLACK, Edwin",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN,left_only
133,1896,Athens,Tennis,Tennis,"ROBERTSON, George Stuart",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN,left_only
134,1896,Athens,Tennis,Tennis,"BOLAND, John",ZZX,Men,Doubles,Gold,NaN,NaN,NaN,left_only
135,1896,Athens,Tennis,Tennis,"TRAUN, Friedrich",ZZX,Men,Doubles,Gold,NaN,NaN,NaN,left_only
136,1896,Athens,Tennis,Tennis,"KASDAGLIS, Dionysios",ZZX,Men,Doubles,Silver,NaN,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...
31072,2012,London,Weightlifting,Weightlifting,Pending,NaN,Women,63KG,Gold,NaN,NaN,NaN,left_only
31077,2012,London,Weightlifting,Weightlifting,"MARTIN, Razvan Constantin",ROU,Men,69KG,Bronze,NaN,NaN,NaN,left_only
31079,2012,London,Weightlifting,Weightlifting,"COCOS, Roxana Daniela",ROU,Women,69KG,Silver,NaN,NaN,NaN,left_only
31091,2012,London,Weightlifting,Weightlifting,Pending,NaN,Men,94KG,Silver,NaN,NaN,NaN,left_only
31110,2012,London,Wrestling,Wrestling Freestyle,"KUDUKHOV, Besik",NaN,Men,Wf 60 KG,Silver,NaN,NaN,NaN,left_only

In [107]:
summer_new = summer.merge(dic, how= "left", on= "Code", indicator= True)

In [109]:
summer_new[summer_new._merge == "left_only"]

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Country,Population,GDP per Capita,_merge
132,1896,Athens,Tennis,Tennis,"FLACK, Edwin",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN,left_only
133,1896,Athens,Tennis,Tennis,"ROBERTSON, George Stuart",ZZX,Men,Doubles,Bronze,NaN,NaN,NaN,left_only
134,1896,Athens,Tennis,Tennis,"BOLAND, John",ZZX,Men,Doubles,Gold,NaN,NaN,NaN,left_only
135,1896,Athens,Tennis,Tennis,"TRAUN, Friedrich",ZZX,Men,Doubles,Gold,NaN,NaN,NaN,left_only
136,1896,Athens,Tennis,Tennis,"KASDAGLIS, Dionysios",ZZX,Men,Doubles,Silver,NaN,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...
31072,2012,London,Weightlifting,Weightlifting,Pending,NaN,Women,63KG,Gold,NaN,NaN,NaN,left_only
31077,2012,London,Weightlifting,Weightlifting,"MARTIN, Razvan Constantin",ROU,Men,69KG,Bronze,NaN,NaN,NaN,left_only
31079,2012,London,Weightlifting,Weightlifting,"COCOS, Roxana Daniela",ROU,Women,69KG,Silver,NaN,NaN,NaN,left_only
31091,2012,London,Weightlifting,Weightlifting,Pending,NaN,Men,94KG,Silver,NaN,NaN,NaN,left_only
31110,2012,London,Wrestling,Wrestling Freestyle,"KUDUKHOV, Besik",NaN,Men,Wf 60 KG,Silver,NaN,NaN,NaN,left_only

### Arithmetic operations between DataFrames / Alignment

__Import__ the csv-files __ath_2008.csv__ and __ath_2012.csv__ with all medals winners in the Sport __Athletics__ in the Editions __2008__ and __2012__.

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__. (Hint: add should contain an index with the Athlete names and three columns, Gold, Silver, Bronze)

__Sort__ add by Gold, Silver, Bronze from __high to low__! Change datatype to __integer__, if necessary! The first Athlete in your DataFrame should be ... no surprise ... Usain Bolt with 6 Gold and 0 Silver and Bronze Medals.

In [125]:
ath_2008 = pd.read_csv("ath_2008.csv", index_col= "Athlete")
ath_2012 = pd.read_csv("ath_2012.csv", index_col= "Athlete")

In [126]:
ath_2008.sort_values(by= "Gold", ascending= False)

                  Gold  Silver  Bronze
Athlete
BOLT, Usain          3       0       0
BEKELE, Kenenisa     2       0       0
MERRITT, LaShawn     2       0       0
DIBABA, Tirunesh     2       0       0
TAYLOR, Angelo       2       0       0
...                ...     ...     ...
IDOWU, Phillips      0       1       0
IDOKO, Franca        0       0       1
GHARIB, Jaouad       0       1       0
GEVAERT, Kim         0       1       0
ZHOU, Chunxiu        0       0       1

[159 rows x 3 columns]

In [128]:
ath_2012.sort_values(by= "Gold", ascending= False)

                          Gold  Silver  Bronze
Athlete
FELIX, Allyson               3       0       0
BOLT, Usain                  3       0       0
RICHARDS-ROSS, Sanya         2       0       0
FARAH, Mo                    2       0       0
ADAMS, Valerie               1       0       0
...                        ...     ...     ...
HENRY-ROBINSON, Samantha     0       1       0
HEJNOVA, Zuzana              0       0       1
HEIDLER, Betty               0       1       0
HEFFERNAN, Robert            0       0       1
ZHANG, Wenxiu                0       0       1

[171 rows x 3 columns]

In [132]:
added = ath_2008.add(ath_2012, fill_value= 0)

In [133]:
added.columns

Index(['Gold', 'Silver', 'Bronze'], dtype='object')

In [134]:
added.sort_values(by = ['Gold', 'Silver', 'Bronze'], ascending= False)

                         Gold  Silver  Bronze
Athlete
BOLT, Usain               6.0     0.0     0.0
FELIX, Allyson            4.0     1.0     0.0
DIBABA, Tirunesh          3.0     0.0     1.0
TAYLOR, Angelo            2.0     1.0     0.0
BEKELE, Kenenisa          2.0     0.0     0.0
...                       ...     ...     ...
WILLIAMS, Novelene        0.0     0.0     1.0
WILLIAMS-MILLS, Novlene   0.0     0.0     1.0
YEGO, Alfred Kirwa        0.0     0.0     1.0
YURCHENKO, Denys          0.0     0.0     1.0
ZHOU, Chunxiu             0.0     0.0     1.0

[298 rows x 3 columns]

-------------------------------------

## Option 2: Guided and Instructed

# STOP HERE, IF YOU WANT TO DO THE EXERCISE ON YOUR OWN!

+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

In [ ]:
#run the cell
import pandas as pd

### Concatenating DataFrames vertically

In [ ]:
#run the cell
cars = pd.read_csv("cars_clean.csv")

__Inspect__ the __cars__ DataFrame!

In [ ]:
#run the cell
cars.head()

In [ ]:
#run the cell
cars.tail()

In [ ]:
#run the cell
cars.info()

__Inspect__ the cars_jap DataFrame!

In [ ]:
#run the cell
cars_jap = pd.read_csv("cars_jap.csv")

In [ ]:
#run the cell
cars_jap.head()

Before we can concatenate both DataFrames, we need to __align__ them!<br>
108. __Insert__ the column __origin__ to __cars_jap__ at the most appropriate position! __Fill in the gaps!__

In [ ]:
cars_jap.---(---, ---, "japan")

Also the column labels should match. <br>
109. __Overwrite__ the column labels in __cars_jap__ and use the same column labels that we have in cars!

__Inspect__!

In [ ]:
#run the cell
cars_jap.head()

110. __Concatenate__ both DataFrames __vertically__ and create a __new RangeIndex__! __Save__ the new DataFrame in the variable __cars_all__!

__Inspect__!

In [ ]:
#run the cell
cars_all.head()

In [ ]:
#run the cell!
cars_all.tail()

111. __Sort cars_call__ by the __model_year__ from __low to high__! Create a __new RangeIndex__ (drop the old)! __Fill in the gaps__!

In [ ]:
cars_all = cars_all.---("model_year").---(drop = True)

__Inspect__!

In [ ]:
#run the cell
cars_all.head()

In [ ]:
#run the cell
cars_all.tail()

In [ ]:
#run the cell
cars_all.info()

----------------------------------------------------------------------

### Left Join

In [ ]:
# run the cell!
summer = pd.read_csv("summer.csv")

__Inspect__ the __summer__ DataFrame!

In [ ]:
# run the cell!
summer.head()

In [ ]:
# run the cell!
dic = pd.read_csv("dictionary.csv")

__Inspect__ dict!

In [ ]:
# run the cell!
dic.head()

__dic__ contains the Olympic Games __Country Codes__ ("Code") with the corresponding __full country names__ ("Country") as well as recent __Population__ and __GDP__ statistics.<br>

112. __Create__ the columns __Country__, __Population__ and __GDP per Capita__ in the __summer__ DataFrame by using a __Left Join__ with __pd.merge()__. <br>
__Save__ the merged Dataframe in the variable __summer_new__! __Fill in the gaps__!

In [ ]:
summer_new = pd.merge(---, ---, how = "left", left_on= ---, right_on = ---)

__Inspect__ summer_new!

In [ ]:
# run the cell!
summer_new.head()

In [ ]:
# run the cell!
summer_new.info()

Apparently, __dic__ does __not contain__ additional information for __all olympic country codes__ that are in the __summer__ Dataframe.

113. __Filter__ summer_new for the elements in the column __Country_x__, where the __corresponding value__ in the column __Code__ is __missing__! <br>
__Count__ the frequency! __Fill in the gaps__!

In [ ]:
summer_new.loc[summer_new.Code.---, "Country_x"].---

For these country codes, we need to find __other sources__ for additional information on the __full country name__, __population__ and __gdp__ (most of these countries do not exist any more.) -> BONUS EXERCISE ;-)

--------------------------

### Arithmetic operations between DataFrames / Alignment

In [ ]:
#run the cell
ath_2008 = pd.read_csv("ath_2008.csv")
ath_2012 = pd.read_csv("ath_2012.csv")

__Inspect__ the __ath_2008__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2008__.

In [ ]:
#run the cell
ath_2008.head()

In [ ]:
#run the cell
ath_2008.info()

__Inspect__ the __ath_2012__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2012__.

In [ ]:
#run the cell
ath_2012.head()

In [ ]:
#run the cell
ath_2012.info()

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__!

114. First, __set__ the __Athlete__ column as the __index__ in both DataFrames! __Save__ the changes!

115. __Add__ both DataFrames with the __most appropriate method__! __Save__ the resulting DataFrame in the variable __add__!

__Inspect__!

In [ ]:
#run the cell
add.head(10)

116. __Sort__ the athletes by the number of __Gold__, __Silver__ and __Bronze__ medals from __high to low__!<br>
__Fill in the gaps!__ Who is the top athlete?

In [ ]:
add = add.sort_values(---, ascending = ---).astype("int")

In [ ]:
# run the cell!
add.head()

In [ ]:
# run the cell!
add.tail()

No surprise, it´s Usain Bolt!

# Well Done!

------------------------------------------------

# Hints (Spoiler!)

108. insert() method, index pos. 7

109. columns attribute

110. pd.concat() method, ignore index

111. methods sort_values() and reset_index()

112. left DataFrame: summer, on "Country" and "Code"

113. methods isnull() and value_counts()

114. set_index() method

115. add() method, fill_value = 0

116. pass a list of columns to sort_values() method (sequence matters!)